'''
K|N 0   1   2   3   4   5   6   7   8   9   10
1   1   1   1   1   1   1   1   1   1   1   1
2   1   2   3   4   5   6   7   8   9   10  11
3   1   3   6   10  15  21  28
4   1   4   10  20  35  56  84
5   1   5   15  
6   1
7   1

f(n, k) = f(n, k-1) + f(n-1, k-1) + ... f(0, k-1)

 f(0, 2) = (0+0)
 f(1, 2) = (1+0, 0+1)
 f(2, 2) = (1+1, 2+0, 0+2)
 f(2, 3) = (0+0+2) | (1+0+1, 0+1+1) | (1+1+0, 2+0+0, 0+2+0)

위의 식은 f(n, k) = f(n-1, k) + f(n, k-1) 로 계산 가능(성능 개선)

'''

MODULO = 1000000000

N, K = map(int, input().split())

dp = [[1] * (N+1) for _ in range(K+1)]

for i in range(2, K+1) :
    for j in range(1, N+1) :
        dp[i][j] = (dp[i-1][j] + dp[i][j-1]) % MODULO

# print(*dp, sep = '\n')
print(dp[K][N])